# Задача 2: Найдите сумму цифр трехзначного числа.
#
# *Пример:*
#
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

a = int(input('Введите число: '))
count = 0
for i in range(3):
    count = count + a % 10
    a = a // 10
print(count)

